## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                      |
|----------|-----------------------------------------------|
| recreate | `aws_sns_topic_subscription.cloudwatch_alarm` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic_subscription.cloudwatch_alarm must be replaced
-/+ resource "aws_sns_topic_subscription" "cloudwatch_alarm" {
      ~ arn                             = "arn:aws:sns:ca-central-1:283582579564:github-secret-scanning-cloudwatch-alarm:4918655f-2118-470c-8335-af2ce8bf7b37" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      - delivery_policy                 = "" -> null
      ~ endpoint                        = (sensitive value) # forces replacement
      - filter_policy                   = "" -> null
      ~ filter_policy_scope             = "" -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:283582579564:github-secret-scanning-cloudwatch-alarm:4918655f-2118-470c-8335-af2ce8bf7b37" -> (known after apply)
      ~ owner_id                        = "283582579564" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      - redrive_policy                  = "" -> null
      - replay_policy                   = "" -> null
      - subscription_role_arn           = "" -> null
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_secret_detected"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.api_error"]

21 tests, 18 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
